# Subsetting and Descriptive Stats

## Before your start:
   - Remember that you just need to do one of the challenges.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in IronHack's database.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly: enjoy the process!
   
#### Import all the necessary libraries here:

In [1]:
import pandas as pd
import numpy as np
import matplotlib
import statistics
import random
import sqlalchemy

# [ONLY ONE MANDATORY] Challenge 1
#### In this challenge we will use the `Temp_States`  dataset. 

#### First import it into a dataframe called `temp`.

In [ ]:
# your code here

#### Print `temp`.

In [ ]:
# your code here

#### Explore the data types of the *temp* dataframe. What types of data do we have? Comment your result.

In [ ]:
# your code here

In [ ]:
"""
your comments here
"""

#### Select the rows where state is New York.

In [ ]:
# your code here

#### What is the average temperature of cities in New York?

In [ ]:
# your code here

#### Which states and cities have a temperature above 15 degrees Celsius?

In [ ]:
# your code here

#### Now, return only the cities that have a temperature above 15 degrees Celsius.

In [ ]:
# your code here

#### Which cities have a temperature above 15 degrees Celcius and below 20 degrees Celsius?

**Hint**: First, write the condition. Then, select the rows.

In [ ]:
# your code here

#### Find the mean and standard deviation of the temperature of each state.

In [ ]:
# your code here

# [ONLY ONE MANDATORY]  Challenge 2

#### Load the `employees` dataset into a dataframe. Call the dataframe `employees`.

In [2]:
from sqlalchemy import create_engine
driver   = 'mysql+pymysql:'
user     = 'data-students'
password = 'iR0nH@cK-D4T4B4S3'
ip       = '34.65.10.136'
database = 'employees'
connection_string = f'{driver}//{user}:{password}@{ip}/{database}'
print(connection_string)
engine = create_engine(connection_string)
print(engine)
pd.read_sql('SHOW TABLES;', engine)

mysql+pymysql://data-students:iR0nH@cK-D4T4B4S3@34.65.10.136/employees
Engine(mysql+pymysql://data-students:***@34.65.10.136/employees)

  Tables_in_employees
0            absences
1           employees
2  employees_advanced

In [3]:
employees = pd.read_sql('SELECT * FROM employees;', engine)

In [4]:
employees.to_csv('db_employees.csv')

#### Explore the data types of the `employees` dataframe. Comment your results.

In [12]:
employees

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
6  Carlos         IT    Master      M         VP      8      70
7   Pedro         IT       Phd      M  associate      7      60
8     Ana         HR    Master      F         VP      8      70

In [13]:
employees.describe()

          Years     Salary
count  9.000000   9.000000
mean   4.111111  48.888889
std    2.803767  16.541194
min    1.000000  30.000000
25%    2.000000  35.000000
50%    3.000000  55.000000
75%    7.000000  60.000000
max    8.000000  70.000000

In [ ]:
"""
your comments here
"""

#### What's the average salary in this company?

In [5]:
print(' the average salary is of ',employees['Salary'].mean(), '$')

 the average salary is of  48.888888888888886 $

#### What's the highest salary?

In [6]:
print(' the highest salary is of ',employees['Salary'].max(), '$')

 the highest salary is of  70 $

#### What's the lowest salary?

In [7]:
print(' the lowest salary is of ',employees['Salary'].min(), '$')

 the lowest salary is of  30 $

#### Who are the employees with the lowest salary?

In [8]:
employees_lowest_income = pd.read_sql('SELECT * FROM employees WHERE Salary = (SELECT MIN(Salary) FROM employees)', engine)
employees_lowest_income

    Name Department Education Gender    Title  Years  Salary
0  Maria         IT    Master      F  analyst      2      30
1  David         HR    Master      M  analyst      2      30

#### Find all the information about an employee called David.

In [9]:
david = pd.read_sql('SELECT * FROM employees WHERE Name = "David"', engine)
david

    Name Department Education Gender    Title  Years  Salary
0  David         HR    Master      M  analyst      2      30

#### Could you return only David's salary?

In [10]:
david_salary = pd.read_sql('SELECT Salary FROM employees WHERE Name= "David"', engine)
david_salary

   Salary
0      30

#### Print all the rows where job title is associate.

In [11]:
associate = pd.read_sql('SELECT * FROM employees WHERE Title = "associate"', engine)
associate

     Name Department Education Gender      Title  Years  Salary
0  Samuel      Sales    Master      M  associate      3      55
1     Eva      Sales  Bachelor      F  associate      2      55
2   Pedro         IT       Phd      M  associate      7      60

#### Print the first 3 rows of your dataframe.
**Tip**: There are 2 ways to do it. Do it both ways.

In [12]:
#with the head method
employees.head(3)

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

In [13]:
#with the iloc
employees.iloc[:3]

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

#### Find the employees whose title is associate and whose salary is above 55.

In [14]:
associate_55 = pd.read_sql('SELECT * FROM employees WHERE Tile = "associate" AND Salary = (SELECT * FROM )

SyntaxError: EOL while scanning string literal (<ipython-input-14-ff2c1caa65b9>, line 1)

In [19]:
associate_55_filter =(employees['Title'] == 'associate') & (employees['Salary']>55)

In [20]:
associate_55 = employees[associate_55_filter]

associate_55

    Name Department Education Gender      Title  Years  Salary
7  Pedro         IT       Phd      M  associate      7      60

#### Group the employees by number of years of employment. What are the average salaries in each group?

In [23]:
#Grouping by years to see, for each year, how many employees belong to each Year category

years_groupby = employees.groupby('Years').agg('count')

years_groupby

       Name  Department  Education  Gender  Title  Salary
Years
1         1           1          1       1      1       1
2         3           3          3       3      3       3
3         1           1          1       1      1       1
4         1           1          1       1      1       1
7         1           1          1       1      1       1
8         2           2          2       2      2       2

####  What is the average salary per title?

In [36]:
#Grouping By Titles, & Years in the company, gives the average salary for each title
years_groupby = employees.groupby(['Title', 'Years']).agg({'Salary':'mean'})
years_groupby

                 Salary
Title     Years
VP        8          70
analyst   1          35
          2          30
          4          35
associate 2          55
          3          55
          7          60

####  Find the salary quartiles.

In [41]:
salary_quartiles = employees.quantile(q=[0, 0.25, 0.5, 0.75])

salary_quartiles

      Years  Salary
0.00    1.0    30.0
0.25    2.0    35.0
0.50    3.0    55.0
0.75    7.0    60.0

#### Is the mean salary different per gender?

In [45]:
employees.groupby('Gender').agg({'Salary':'mean'})

        Salary
Gender
F         47.5
M         50.0

#### Find the minimum, mean and maximum of all numeric columns for each company department.

In [48]:
employees.describe()

          Years     Salary
count  9.000000   9.000000
mean   4.111111  48.888889
std    2.803767  16.541194
min    1.000000  30.000000
25%    2.000000  35.000000
50%    3.000000  55.000000
75%    7.000000  60.000000
max    8.000000  70.000000

#### Bonus Question:  for each department, compute the difference between the maximum and the minimum salary.
**Hint**: try using `agg` or `apply` combined with `lambda` functions.

In [58]:
employees_max_min = employees.groupby('Department').agg({'Salary':['max', 'min']})
employees_max_min

           Salary
              max min
Department
HR             70  30
IT             70  30
Sales          55  55

In [64]:
employees_max_min["Salary", "diff"] = employees_max_min["Salary", "max"] - employees_max_min["Salary", "min"]

In [65]:
employees_max_min

           Salary
              max min diff
Department
HR             70  30   40
IT             70  30   40
Sales          55  55    0

# [ONLY ONE MANDATORY] Challenge 3
#### Open the `Orders` dataset. Name your dataset `orders`.

In [ ]:
# your code here

#### Explore your dataset by looking at the data types and summary statistics. Comment your results.

In [ ]:
# your code here

In [ ]:
"""
your comments here
"""

####  What is the average purchase price?

In [ ]:
# your code here

#### What are the highest and lowest purchase prices?

In [ ]:
# your code here

#### Select all the customers from Spain.
**Hint**: Remember that you are not asked to find orders from Spain but customers. A customer might have more than one order associated.

In [ ]:
# your code here

#### How many customers do we have in Spain?

In [ ]:
# your code here

#### Select all the customers who have bought more than 50 items.
**Hint**: Remember that you are not asked to find orders with more than 50 items but customers who bought more than 50 items. A customer with two orders of 30 items each should appear in the selection.

In [ ]:
# your code here

#### Select orders from Spain that include more than 50 items.

In [ ]:
# your code here

#### Select all free orders.

In [ ]:
# your code here

#### Select all orders whose description starts with `lunch bag`.
**Hint**: use string functions.

In [ ]:
# your code here

#### Select all `lunch bag` orders made in 2011.

In [ ]:
# your code here

#### Show the frequency distribution of the amount spent in Spain.

In [ ]:
# your code here

#### Select all orders made in the month of August.

In [ ]:
# your code here

#### Find the number of orders made by each country in the month of August.
**Hint**: Use value_counts().

In [ ]:
# your code here

#### What's the  average amount of money spent by country?

In [ ]:
# your code here

#### What's the most expensive item?

In [ ]:
# your code here

#### What is the average amount spent per year?

In [ ]:
# your code here